<?php

/*
 |--------------------------------------------------------------------------
 | 全局错误码
 |--------------------------------------------------------------------------
*/

return [

    /*
     |--------------------------------------------------------------------------
     | 200 成功
     |--------------------------------------------------------------------------
    */

    500 => '缺少Token',
    501 => 'Token无效',
    502 => 'Token无效!',


    600 => '账号不存在',
    601 => '账号或密码不正确',
    602 => '账号未开启，请先联系管理员',
    666 => '请求频繁，先休息一下吧',

    700 => '手机号格式不正确~',
    701 => '手机号格式不正确',
    702 => '网络超时',


    /*
     |--------------------------------------------------------------------------
     | 11000-12000 后端操作码
     |--------------------------------------------------------------------------
    */

    900 => '账号已存在',
    901 => '后端用户创建失败',
    902 => '账号已存在',
    903 => '后端用户数据修改失败',
    904 => '此数据不存在',
    905 => '数据删除失败',
    906 => '该用户下有角色，请先删除角色',
    907 => '角色名称已存在',
    908 => '角色创建失败',
    909 => '角色名称已存在',
    910 => '角色修改失败',
    11000 => '角色信息不存在',
    11001 => '这个角色被使用，请先解除',
    11002 => '角色删除失败',

    11003 => '权限名称已存在',
    11004 => '权限创建失败',
    11005 => '权限名称已存在',
    11006 => '权限修改失败',
    11007 => '权限不存在',
    11008 => '有角色使用该权限，请先删除绑定关系',
    11009 => '权限删除失败',

    11010 => '数据插入失败',
    11011 => '数据修改失败',
    11012 => '数据插入失败',

    11013 => '用户数据不存在',

    11014 => '权限分配失败',
    11015 => '权限修改失败',
    11016 => '权限修改失败',

    11017 => '角色数据不存在',


    11018 => '项目已存在',
    11019 => '项目数据创建失败',
    11020 => '项目数据创建失败',


    11021 => '项目名称已存在',
    11022 => '项目数据不存在',
    11023 => '项目修改失败',
    11024 => '项目修改失败',
    11025 => '项目修改失败',

    11026 => '项目数据不存在',
    11027 => '项目数据不存在',
    11028 => '数据删除失败',
    11029 => '数据删除失败',
    11030 => '数据删除失败',

    11031 => '项目数据不存在',

    11032 => '员工信息添加失败',
    11033 => '员工信息添加失败',

    11034 => '员工信息不存在',
    11035 => '员工信息修改失败',
    11036 => '员工信息修改失败',
    11037 => '员工信息修改失败',
    11045 => '员工信息修改失败',
    11046 => '员工信息修改失败',

    11038 => '员工数据不存在',
    11039 => '该员工下还存在项目信息，请先取消他的项目',
    11040 => '员工数据删除失败',

    11041 => '员工数据不存在',
    11042 => '该员工下还存在项目信息，请先取消他的项目',
    11043 => '员工删除失败',

    11044 => '员工工时填写失败，请稍后重试',


    11047 => '用户数据不存在',
    11048 => '旧密码输入不正确',
    11049 => '两次密码输入不一致',
    11050 => '信息修改失败',

    11051 => '月份数据添加失败',
    11052 => '月份数据不存在',
    11053 => '月份数据修改失败',
    11054 => '月份数据不存在',

    110555 => '月份数据不存在',
    110556 => '月份数据删除失败',

    110557 => '该员工已经在这个项目中',
    110558 => '该项目员工添加失败',


];
